In [3]:
import pandas as pd

In [4]:
datas = pd.read_excel("F:\kunal\customer email.xlsx")
datas

     Name                          Mail
0      kk  kkenteprises101010@gmail.com
1  Nikhil     nikhilkamble445@gmail.com
2   vaman            myrule65@gmail.com

In [5]:
desc={'Name':['kunal',"Nikhil","Niru",'Parshan'],
       "age": [ 29,28,31,25],
        'Position': ['sales Engineer',"account",'sales Manager','drawing'],
         "salary": [30000,15000,30000,15000]}

In [6]:
raw_data = pd.DataFrame(desc)

In [7]:
raw_data

      Name  age        Position  salary
0    kunal   29  sales Engineer   30000
1   Nikhil   28         account   15000
2     Niru   31   sales Manager   30000
3  Parshan   25         drawing   15000

In [14]:
raw_data.describe()

         age        salary
count   4.00      4.000000
mean   28.25  22500.000000
std     2.50   8660.254038
min    25.00  15000.000000
25%    27.25  15000.000000
50%    28.50  22500.000000
75%    29.50  30000.000000
max    31.00  30000.000000

In [11]:
raw_data.shape

(4, 4)

In [16]:
raw_data.tail(2)

      Name  age       Position  salary
2     Niru   31  sales Manager   30000
3  Parshan   25        drawing   15000

In [20]:
raw_data[['Name','age']]

      Name  age
0    kunal   29
1   Nikhil   28
2     Niru   31
3  Parshan   25

In [22]:
raw_data.loc[0:2,['Name',"age"]]

     Name  age
0   kunal   29
1  Nikhil   28
2    Niru   31

In [23]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   age       4 non-null      int64
 2   Position  4 non-null      object
 3   salary    4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [1]:
raw_data.describe()

NameError: name 'raw_data' is not defined

In [8]:
raw_data.describe()

         age        salary
count   4.00      4.000000
mean   28.25  22500.000000
std     2.50   8660.254038
min    25.00  15000.000000
25%    27.25  15000.000000
50%    28.50  22500.000000
75%    29.50  30000.000000
max    31.00  30000.000000

In [9]:
raw_data

      Name  age        Position  salary
0    kunal   29  sales Engineer   30000
1   Nikhil   28         account   15000
2     Niru   31   sales Manager   30000
3  Parshan   25         drawing   15000

In [12]:
raw_data.loc[0,'Name']= 'Ram'

In [20]:
raw_data

      Name  age        Position  salary
0      Ram   29  sales Engineer   30000
1   Nikhil   28         account   15000
2     Niru   31   sales Manager   30000
3  Parshan   25         drawing   15000

In [23]:
raw_data['point']= [ 5,6,7,5]

In [38]:
raw_data.drop('position',axis=1,inplace=True)

KeyError: "['position'] not found in axis"

In [39]:
raw_data

      Name  age Position  salary  point
0      Ram   29    power   30000      5
1   Nikhil   28    power   15000      6
2     Niru   31    power   30000      7
3  Parshan   25    power   15000      5

ValueError: Length of values does not match length of index

In [36]:
raw_data

      Name  age Position  salary  point
0      Ram   29    power   30000      5
1   Nikhil   28    power   15000      6
2     Niru   31    power   30000      7
3  Parshan   25    power   15000      5